; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(have_image Planet5 spectrograph0)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon7 thermograph2)
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 thermograph2)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon7 instrument0 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon6 instrument0 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon12 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon10 instrument0 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 4 of 8
12. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 8
13. (take_image satellite0 phenomenon8 instrument0 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 5 of 8
14. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 5 of 8
15. (take_image satellite0 planet11 instrument0 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 6 of 8
16. (turn_to satellite0 planet5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet5)
   goals met: 6 of 8
17. (take_image satellite0 planet5 instrument0 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 7 of 8
18. (turn_to satellite0 star9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
19. (take_image satellite0 star9 instrument0 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 8 of 8
